---
layout: post
status: publish
published: true
title: Apple, ter ou n&atilde;o ter? Eis a quest&atilde;o.
date: '2006-01-07 15:49:36 -0200'
date_gmt: '2006-01-07 18:49:36 -0200'
categories:
- Geral
tags: []
comments:
- id: 17
  author: Leonardo Menezes
  author_email: leommenezes@gmail.com
  author_url: ''
  date: '2006-01-09 17:13:01 -0200'
  date_gmt: '2006-01-09 20:13:01 -0200'
  content: Desculpe o Off-topic mas, queria saber se vc &eacute; de Jo&atilde;o Pessoa,
    se for, se conhece algum curso de Java em Jo&atilde;o Pessoa, e se vc sabe a remunera&ccedil;&atilde;o
    m&eacute;dia de um profissional de internet em Jampa.  Se n&atilde;o for iguinore
    este post
- id: 18
  author: H&eacute;lio Correia
  author_email: contato@heliocorreia.org
  author_url: ''
  date: '2006-01-11 11:41:35 -0200'
  date_gmt: '2006-01-11 14:41:35 -0200'
  content: |-
    Sou sim, da terra da paz e tranq&uuml;ilidade. N&atilde;o estou por dentro dos cursos dispon&iacute;veis. Se j&aacute; tiver alguma base de programa&ccedil;&atilde;o, ou se estiver disposto, recomendo:

    Thinking In Java
    http://www.mindview.net/Books/TIJ/

    Sobre a remunera&ccedil;&atilde;o&hellip; Se voc&ecirc; encontrar um emprego na faixa de R$2.000,00, provavelmente voc&ecirc; teria uma certifica&ccedil;&atilde;o Java. Infelizmente a mentalidade, geral, &eacute; pagar por Analista ou Desenvolvedor, mas cobrar trabalho como Engenheiro de Sistemas, Desenvolvedor e DBA.
---
<p>Ando analisando a possibilidade de comprar um <a href="http://www.apple.com/ibook/">iBook</a>, ou <a href="http://www.apple.com/powerbook/">Powerbook</a>. Escuto por qualquer lugar que eu v&aacute;: "<em>O mundo da Apple &eacute; uma ilha, as atualiza&ccedil;&otilde;es de hardware sempre demandam um alto custo financeiro</em>". Ou ainda: "<em>Existe configura&ccedil;&otilde;es muito semelhantes, ou melhores, a um custo bem inferior.</em>"</p>
<p>Quando converso ou leio <a href="http://www.notebookreview.com/default.asp?newsID=2648&amp;review=Apple+PowerBook+G4+%2D+PPC+G4+1%2E67+GHz+%2D+17">an&aacute;lises</a> de usu&aacute;rios Apple, lembro do filme Matrix:</p>
<blockquote><p>"<em>I am trying to free your mind Neo. But I can only show you the door. You are the One that has to walk through it. You have to let it all go Neo, Fear, doubt and disbelief. Free your mind!</em>" (Morpheus)</blockquote><br />
Concordo com a id&eacute;a que "exista uma diferen&ccedil;a entre conhecer o caminho e percorrer o caminho". Sei que a beleza de seus produtos &eacute; um quesito incontest&aacute;vel. Mas o que realmente faz valer tal investimento em produtos Apple? Ser&aacute; paix&atilde;o, qualidade de hardware ou, como dizem, um trato minuncioso com a barreira que divide o ser humano e as m&aacute;quinas?</p>
<p>Bem, o que posso dizer &eacute; que estou muito interessado em conhecer este mundo, basta aparecer uma oportunidade ($$$) que eu possa encarar. &Eacute; verdade que o custo j&aacute; caiu muito, mas ainda est&aacute; alto para pobres mortais.</p>
<p>Mas qual ser&aacute; o custo da migra&ccedil;&atilde;o? Sinceramente n&atilde;o tenho a m&iacute;nima id&eacute;ia o qu&atilde;o complicado/f&aacute;cil ser&aacute;. Atualmente trabalho com Linux e Windows, semelhantes. Navegando &eacute; poss&iacute;vel encontrar <a href="http://macspecialist.org/content/articles/essential_apps/">diversas solu&ccedil;&otilde;es</a> para o mundo Apple.</p>
<p>Pelo que pude perceber at&eacute; agora, meu dia-a-dia n&atilde;o seria afetado pela mudan&ccedil;a, j&aacute; que posso encontrar solu&ccedil;&otilde;es semelhantes neste, quem sabe, futuro novo mundo.</p>
