---
layout: post
status: publish
published: true
title: Rumores indicam venda da Zend por U$113 milh&otilde;es
date: '2006-04-03 15:32:15 -0300'
date_gmt: '2006-04-03 18:32:15 -0300'
categories:
- Geral
tags: []
comments:
- id: 20
  author: Thiago Montini
  author_email: thiagomontini@gmail.com
  author_url: http://www.impermanentes.com.br
  date: '2006-04-03 15:55:53 -0300'
  date_gmt: '2006-04-03 18:55:53 -0300'
  content: |-
    Ent&atilde;o, isso ta me parecendo 1&ordm; de abril ainda.....  to em d&uacute;vida....
    bom, tendo confirma&ccedil;&atilde;o desses rumores n&atilde;o deixe de postar :)
- id: 21
  author: heliocorreia
  author_email: contato@heliocorreia.org
  author_url: http://heliocorreia.org/
  date: '2006-04-03 19:04:42 -0300'
  date_gmt: '2006-04-03 22:04:42 -0300'
  content: '&Eacute; bem natural que isto pode ser um boato. Dei uma olhada sem seu
    <a href="http:&#47;&#47;impermanentes.com.br&#47;2006&#47;04&#47;03&#47;microsoft-compra-zend-nao-ainda-nao&#47;"
    rel="nofollow">post</a>, mas ainda prefiro aguardar se &eacute; verdade ou
    n&atilde;o.'
- id: 22
  author: Leonardo
  author_email: leonardo.nakahara@gmail.com
  author_url: ''
  date: '2006-04-04 09:09:56 -0300'
  date_gmt: '2006-04-04 12:09:56 -0300'
  content: |-
    Eu li numa lista de discuss&atilde;o que &eacute; boato, j&aacute; que a not&iacute;cia foi postada no fim de semana do 1o de Abril.

    Outra coisa que &eacute; engra&ccedil;ada &eacute; que o nome do tal CIO (Al Porfoli ) lembra muito na sonoridade em ingl&ecirc;s o nome dado ao 1o de Abril (April's Fool)
- id: 23
  author: Leonardo
  author_email: leonardo.nakahara@gmail.com
  author_url: ''
  date: '2006-04-04 09:11:58 -0300'
  date_gmt: '2006-04-04 12:11:58 -0300'
  content: |-
    Parece se tratar de um boato. Afinal, essa not&iacute;cia foi jogada na m&iacute;dia no final de semana do 1o de Abril (e essa brincadeira &eacute; muito mais forte em outros pa&iacute;ses que no Brasil). Al&eacute;m do mais, em termos de sonoridade, o nome do CIO Italiano, o tal Al Porfoli, soa muito com o nome em ingl&ecirc;s para o dia da mentira - April's Fool.

    Vamos aguardar, mas para mim &eacute; boato.
---
<p>A Microsoft comprou o lado comercial do <a href="http:&#47;&#47;www.php.net&#47;">PHP</a>. No <a href="http:&#47;&#47;phpro.org&#47;">PHPPro.org</a> encontrei <a href="http:&#47;&#47;phpro.org&#47;articles&#47;Microsoft-Purchases-Zend-for-$113-Million.html">informa&ccedil;&otilde;es</a> sobre o objetivo da transa&ccedil;&atilde;o. O CEO Italiano Al Porfoli declarou que esta &eacute; uma a&ccedil;&atilde;o para tornar a pr&oacute;xima gera&ccedil;&atilde;o da web mais aberta. Fica claro que uma nova safra de ferramentas para desenvolvimento est&aacute; por vir, al&eacute;m daquelas j&aacute; <a href="http:&#47;&#47;www.zend.com&#47;products&#47;">desenvolvidas</a> pela pr&oacute;pria Zend.</p>
<p>Fala-se ainda sobre uma nova certifica&ccedil;&atilde;o, talv&eacute;s uma unifica&ccedil;&atilde;o com a j&aacute; existente <i>Zend Certified Engineer</i> (ZCE), mas com um novo nome: <i>Microsoft Scripting Engine</i> (MSSE).</p>
<p><b>[UPDATE]</b> Se foi 1&ordm; de abril, ou n&atilde;o, vamos aguardar pra ver. A <a href="http:&#47;&#47;groups.google.com&#47;group&#47;arqhp&#47;browse_thread&#47;thread&#47;9ebd70dc2a0685b0&#47;0d44c92ff314771c?q=zend&amp;rnum=2">discuss&atilde;o</a> continua na <a href="http:&#47;&#47;groups.google.com&#47;group&#47;arqhp?lnk=li">ArqHP</a>.</p>
