---
layout: post
status: publish
published: true
title: Colabora&ccedil;&atilde;o entre os navegadores
date: '2005-11-28 08:33:54 -0200'
date_gmt: '2005-11-28 11:33:54 -0200'
categories:
- Geral
tags: []
comments: []
---
<p>Representantes dos navegadores  Internet Explorer, Firefox, Opera, e Konqueror se reuniram para discutir formas mais eficazes para inibir os ataques aos usu&aacute;rios menos atentos. Dentre as <a href="http:&#47;&#47;news.yahoo.com&#47;s&#47;cmp&#47;20051124&#47;tc_cmp&#47;174401623">solu&ccedil;&otilde;es apontadas</a>, algumas j&aacute; est&atilde;o em funcionamento, ou em est&aacute;gio beta de desenvolvimento, como s&atilde;o os casos do Firefox e do Internet Explorer 7, respectivamente.<&#47;p></p>
<p>Vejamos o que ser&aacute; bastante comum nas pr&oacute;ximas vers&otilde;es de nossos navegadores preferidos:<&#47;p></p>
<ul>
<li>Janelas <a href="http:&#47;&#47;en.wikipedia.org&#47;wiki&#47;Popup">popups</a> indicar&atilde;o o endere&ccedil;o real da p&aacute;gina exibida.<&#47;li>
<li>P&aacute;ginas seguras indica&ccedil;&atilde;o um pequeno cadeado na barra de endere&ccedil;o.<&#47;li>
<li>Barra de endere&ccedil;o colorida: Amarelo para p&aacute;ginas seguras, verde para as confi&aacute;veis e vermelho para as consideradas maliciosas.<&#47;li><br />
<&#47;ul></p>
<p>As formas como cada navegador apresentar&aacute; estas e outras informa&ccedil;&otilde;es podem se diferenciar um pouco, mas devem ser t&atilde;o intuitivas como os t&atilde;o conhecidos bot&otilde;es Avan&ccedil;ar e Voltar.<&#47;p></p>
<p>O interessante desta virada de mesa &eacute; que o Internet Explorer, que antes utilizava a vantagem do monop&oacute;lio para ditar os padr&otilde;es, agora est&aacute; <a href="http:&#47;&#47;webstandards.org&#47;press&#47;releases&#47;archive&#47;2005&#47;07&#47;05&#47;index.html">interagino com a comunidade</a>, buscando a <a href="http:&#47;&#47;www.w3c.org&#47;">padroniza&ccedil;&atilde;o</a> que os concorrentes tentam seguir a todo o custo.<&#47;p></p>
<p>Futuramente espera-se que a padroniza&ccedil;&atilde;o seja compat&iacute;vel entre os principais navegadores. Ficar&aacute; a cargo do usu&aacute;rio escolher aquele que &eacute; capaz de oferecer as melhores ferramentas para a necessidade de cada ambiente. Atualmente, para mim, <a href="http:&#47;&#47;www.mozilla.org&#47;products&#47;firefox&#47;">apenas um</a>, dentre os citados acima, &eacute; <a href="https:&#47;&#47;addons.mozilla.org&#47;extensions&#47;?application=firefox">capaz</a> de se adaptar a qualquer tipo de usu&aacute;rio.<br />
<&#47;p></p>
