---
layout: post
status: publish
published: true
title: Desbloqueando sites com o Google
date: '2005-12-26 11:58:31 -0200'
date_gmt: '2005-12-26 14:58:31 -0200'
categories:
- Geral
tags: []
comments:
- id: 11
  author: leonardo
  author_email: santana_leonardo_stm@oi.com.br
  author_url: http://www.orkut.com.br
  date: '2008-05-12 09:24:16 -0300'
  date_gmt: '2008-05-12 12:24:16 -0300'
  content: quero desbloquear este Site !!!!!!
- id: 12
  author: heliocorreia
  author_email: contato@heliocorreia.org
  author_url: http://heliocorreia.org/
  date: '2008-05-12 10:43:42 -0300'
  date_gmt: '2008-05-12 13:43:42 -0300'
  content: Leonardo, pelo que entendi voc&ecirc; quer desbloquear o Orkut. Este "truque"
    s&oacute; permite acessar p&aacute;ginas para leitura, diferente do seu caso,
    que precisar informar usu&aacute;rio e senha.
- id: 13
  author: felipe
  author_email: bielluiz78@h.com
  author_url: http://www.orkute.com.br
  date: '2008-11-20 09:13:29 -0200'
  date_gmt: '2008-11-20 12:13:29 -0200'
  content: eu nao consigo entrar no orkute
- id: 14
  author: Iza&iacute;ane
  author_email: ysayane.jesus@hotmail.com
  author_url: ''
  date: '2009-01-10 20:44:59 -0200'
  date_gmt: '2009-01-10 23:44:59 -0200'
  content: quero desbloquear o orkut, s&oacute; basta colocar essa palavra e aparece
    orkut is banned.
- id: 15
  author: israel
  author_email: pulinho@galinhayahoo.com.br
  author_url: http://orkut
  date: '2010-07-12 07:16:03 -0300'
  date_gmt: '2010-07-12 10:16:03 -0300'
  content: quero desbroquia o site do orkut agora
- id: 16
  author: Danda
  author_email: jhenifer_hellokitty@hotmail.com
  author_url: ''
  date: '2010-08-14 15:36:06 -0300'
  date_gmt: '2010-08-14 18:36:06 -0300'
  content: nem eu hehe
---
<p>N&atilde;o h&aacute; nada mais irritante que tentar acessar um site, e ser surpreendido com uma mensagem: "<em>Acesso Negado. Entre em contato com o departamento de inform&aacute;tica<&#47;em>". Aos poucos que l&ecirc;em este blog, irei dar uma dica, simples, n&atilde;o chega a ser 100% eficaz, mas ajuda bastante.</p>
<p>Partindo do princ&iacute;pio que o Google n&atilde;o &eacute; bloqueado, temos: Eu acesso o Google, que acessa o www.siteproibido.com, ou seja, eu acesso o site proibido, indiretamente. Isto &eacute; poss&iacute;vel atrav&eacute;s do servi&ccedil;o de tradu&ccedil;&atilde;o, um servidor proxy improvisado.</p>
<p>http:&#47;&#47;www.google.com&#47;translate?<strong>langpair=pt-BR|pt-BR<br />
<&#47;strong>&amp;u=http:&#47;&#47;www.siteproibido.com&#47;</p>
<p>O pulo do gato (nova esta, heim?) est&aacute; em modificar o par&acirc;metro <em>langpair<&#47;em>, que indica a l&iacute;ngua de origem e de destino. Basta modificar ambas para o mesmo idioma, simples assim.</p>
<p><strong>Observa&ccedil;&otilde;es<&#47;strong></p>
<ul>
<li>Nem tudo &eacute; perfeito. As acentua&ccedil;&otilde;es aparecem distorcidas, mas d&aacute; para entender. &Eacute; apenas um problema de codifica&ccedil;&atilde;o.<&#47;li>
<li>Existem outros servi&ccedil;os semelhantes, por exemplo: <a href="http:&#47;&#47;www.babelfish.com&#47;">Babelfish</a><&#47;li>
<li>Aos que "pensam" que estar&atilde;o navegando anonimamente, d&ecirc; uma olhada no <a href="http:&#47;&#47;www.google.com&#47;translate?langpair=en|en&amp;u=http:&#47;&#47;www.whatismyip.com&#47;">endere&ccedil;o IP</a> que o <em>site proibido<&#47;em> enxerga.<&#47;li>
<li>Administradores de Rede, de verdade, saber&atilde;o como bloquear o que deve ser bloqueado.<&#47;li><br />
<&#47;ul></p>
