---
layout: post
status: publish
published: true
title: Update do crioulo doido
date: '2006-08-04 09:11:13 -0300'
date_gmt: '2006-08-04 12:11:13 -0300'
categories:
- Geral
tags: []
comments: []
---
<p>Acontece nas melhores <i>Suites</i>...</p>
<p ALIGN="center"><img SRC="http:&#47;&#47;heliocorreia.org&#47;wp-content&#47;uploads&#47;2006&#47;08&#47;adobeupdater.gif" ALT="Dialog Message" &#47;></p></p>
<blockquote><p>"<i>O Adobe Updater deve se atualizar antes que ele possa verificar por atualiza&ccedil;&otilde;es. Gostaria de atualizar o Adobe Updater agora?</i>"</blockquote><br />
No meio deste samba da&nbsp;id&eacute;ia recursiva, l&aacute; est&aacute; o <strong>Sr.&nbsp;OK</strong>, vis&iacute;vel, azul, o centro das aten&ccedil;&otilde;es. Enquanto isso o <strong>Sr. Quit</strong>,&nbsp;t&iacute;mido&nbsp;e transparente,&nbsp;parece&nbsp;sair&nbsp;de&nbsp;fininho...&nbsp;Eis&nbsp;que&nbsp;surge&nbsp;o&nbsp;<strong>Might&nbsp;Mouse</strong>, seu&nbsp;amigo,&nbsp;para enter&aacute;-lo no perigo... CLICK! "J&aacute; &eacute;", ou melhor... j&aacute; era!</p>
<p>As mensagens de advert&ecirc;ncia foram planejadas para ser&nbsp;a&nbsp;"voz"&nbsp;da&nbsp;m&aacute;quina. Mas quando se tagarela muito, o som vira ru&iacute;do e o c&eacute;rebro passa a ignorar tudo o que &eacute; dito. E foi isto o que aconteceu com um amigo, ignorou a "voz da consci&ecirc;ncia":</p>
<p><i>- Update &eacute; update... O que n&atilde;o mata, engorda!</i></p>
<p><i>Downloading</i>... <i>Updating</i>... <strong>Error</strong>! Reinicia,&nbsp;reinstala,&nbsp;desinstala,&nbsp;reinicia,&nbsp;instala...</p>
<p>No dia seguinte...</p>
<p><i>- Maldito bug! Por que eu fui instalar as atualiza&ccedil;&otilde;es? Ih, l&aacute; vem o chefe cobrar os arquivos...</i></p>
<p>Seja do Updater ou da mensagem, a falha existe! E n&atilde;o &eacute; do meu amigo, porque <a HREF="http:&#47;&#47;www.adobeforums.com&#47;cgi-bin&#47;webx&#47;.3bc0ec8f?50@276.XyavgQpYtHQ@">ele n&atilde;o foi a &uacute;nica v&iacute;tima</a>.</p>
<p><strong>Li&ccedil;&otilde;es Aprendidas</strong></p>
<ol>
<li>Leia o que a "voz da consci&ecirc;ncia" tem a lhe dizer, mesmo que voc&ecirc; pense que j&aacute; sabe.</li>
<li>Qualquer atualiza&ccedil;&atilde;o decente traz consigo algo chamado:<strong><i> release notes</i></strong> (notas da vers&atilde;o).</li>
<li>Em time que est&aacute; ganhando n&atilde;o se mexe.</li><br />
</ol></p>
