---
layout: post
status: publish
published: true
title: Jornalista, fa&ccedil;a o Google trabalhar para voc&ecirc;
date: '2006-06-13 11:32:33 -0300'
date_gmt: '2006-06-13 14:32:33 -0300'
categories:
- Geral
tags: []
comments: []
---
<p><img src="http:&#47;&#47;upload.wikimedia.org&#47;wikipedia&#47;commons&#47;thumb&#47;4&#47;43&#47;Feed-icon.svg&#47;128px-Feed-icon.svg.png" alt="Feed Icon" align="right" height="128" width="128" &#47;>Muitas pessoas ainda desconhecem os benef&iacute;cios que um <a href="http:&#47;&#47;en.wikipedia.org&#47;wiki&#47;RSS_%28file_format%29">RSS</a> pode nos trazer. Dando uma olhada na defini&ccedil;&atilde;o do termo, <a href="http:&#47;&#47;pt.wikipedia.org&#47;wiki&#47;RSS">em portugu&ecirc;s</a>, no <a href="http:&#47;&#47;www.wikipedia.org&#47;">Wikipedia</a>:</p>
<blockquote><p><i>"A tecnologia do RSS permite aos usu&aacute;rios da internet se inscrever a sites que fornecem &#039;feeds&#039; RSS. Estes s&atilde;o tipicamente sites que mudam ou atualizam o seu conte&uacute;do regularmente. Para isso, s&atilde;o utilizados Feeds RSS que recebem estas atualiza&ccedil;&otilde;es, desta maneira o usu&aacute;rio pode permanecer informado de diversas atualiza&ccedil;&otilde;es em diversos sites sem precisar visit&aacute;-los um a um."<&#47;i><&#47;blockquote><br />
Vejamos como jornalistas e pessoas em geral podem utilizar o RSS no seu dia-a-dia. Acesse o <a href="http:&#47;&#47;news.google.com&#47;news?ned=pt-BR_br">servi&ccedil;o de News</a> do <a href="http:&#47;&#47;www.google.com&#47;">Or&aacute;culo</a>, em seguida fa&ccedil;a uma busca pelos assuntos que voc&ecirc; sempre procura, por exemplo: "Copa 2006 Brasil". Procure na p&aacute;gina dos resultados pelo termo <a href="http:&#47;&#47;news.google.com&#47;news?hl=pt-BR&amp;lr=&amp;tab=wn&amp;ie=UTF-8&amp;q=Copa+2006+Brasil&amp;output=rss">RSS</a> ou <a href="http:&#47;&#47;news.google.com&#47;news?hl=pt-BR&amp;lr=&amp;tab=wn&amp;ie=UTF-8&amp;q=Copa+2006+Brasil&amp;output=atom">Atom</a>. Agora &eacute; s&oacute; cadastrar este endere&ccedil;o em no seu agregador de feeds. Existe forma mais f&aacute;cil para fazer clipagem de not&iacute;cais? Se existir, me avise!</p>
<p>Abaixo segue uma pequena rela&ccedil;&atilde;o para os que ainda n&atilde;o t&ecirc;m um programa ou servi&ccedil;o para gerenciar seus Feeds.</p>
<p><b>Servi&ccedil;os<&#47;b></p>
<ul>
<li><a href="http:&#47;&#47;www.feedmeme.com&#47;">Feed Meme</a><&#47;li>
<li><a href="http:&#47;&#47;www.feedburner.com&#47;">FeedBurner</a><&#47;li>
<li><a href="http:&#47;&#47;www.rojo.com&#47;">Rojo</a><&#47;li>
<li><a href="http:&#47;&#47;tagsy.com&#47;">tagsy </a><&#47;li>
<li><a href="http:&#47;&#47;bloglines.com&#47;">Bloglines</a><&#47;li><br />
<&#47;ul><br />
<b>Programas<&#47;b></p>
<ul>
<li><a href="http:&#47;&#47;www.rssreader.com&#47;">RssReader</a><&#47;li>
<li><a href="http:&#47;&#47;sage.mozdev.org&#47;">Sage for Firefox</a><&#47;li>
<li><a href="http:&#47;&#47;www.rssbandit.org&#47;">RSS Bandit</a><&#47;li>
<li><a href="http:&#47;&#47;feedreader.com&#47;">FeedReader</a><&#47;li><br />
<&#47;ul><br />
Bom proveito ;)</p>
