---
layout: post
status: publish
published: true
title: Ferramentas gratuitas para notebook
date: '2006-03-16 00:29:33 -0300'
date_gmt: '2006-03-16 03:29:33 -0300'
categories:
- Geral
tags: []
comments: []
---
<p>Desde que me tornei um usu&aacute;rio, percebi a necessidade de tirar o m&aacute;ximo desempenho do notebook, utilizando melhor a bateria dispon&iacute;vel. &Eacute; com base em um <a href="http:&#47;&#47;laptoplogic.com&#47;resources&#47;detail.php?id=33&amp;page=1">post</a> da <a href="http:&#47;&#47;laptoplogic.com&#47;">Laplogic</a>, que trago algumas sugest&otilde;es bem interessantes:</p>
<p><b>Informa&ccedil;&otilde;es do Sistema<&#47;b></p>
<ul>
<li>O <a href="http:&#47;&#47;www.pbus-167.com&#47;chc.htm">Notebook Hardware Control</a> permite prolongar a vida &uacute;til da bateria, reduzir a temperatura dos componentes ao ajustar a velocidade do processador de acordo com as suas necessidades.<&#47;li>
<li>Muitos n&atilde;o sabem, mas o <i>Everest <&#47;i>&eacute; a evolu&ccedil;&atilde;o do <a href="http:&#47;&#47;www.majorgeeks.com&#47;download181.html">Aida32</a>. Depois que a <a href="http:&#47;&#47;www.lavalys.com&#47;">Lavalys</a> o comprou, as &uacute;nicas diferen&ccedil;as significativas ocorrem em ambientes corporativos. Dentre as funcionalidades originais est&atilde;o as informa&ccedil;&otilde;es detalhadas dos componetes (hardware&#47;software) do sistema, formas de diagn&oacute;stico e teste de desempenho.<&#47;li><br />
<&#47;ul><br />
<b>Sistema de Arquivos<&#47;b></p>
<ul>
<li>O desfragmentador "<i>mata a cobra e mostra o pau<&#47;i>" como diz o ditato popular, ao demonstrar detalhadamente a situa&ccedil;&atilde;o do seu sistema de arquivos. Para fazer o download do <a href="http:&#47;&#47;www.oo-software.com&#47;en&#47;download&#47;">Defrag 2000 Free</a> basta preencher um simples formul&aacute;rio. O uso para usu&aacute;rios dom&eacute;sticos &eacute; gratuito. H&aacute; tamb&eacute;m vers&otilde;es para Windows 64-bits e Linux.<&#47;li>
<li>E que tal ter uma no&ccedil;&atilde;o de quanto de espa&ccedil;o cada diret&oacute;rio, ou tipo de arquivo, utiliza em seu disco r&iacute;gido? Conhe&ccedil;a o <a href="http:&#47;&#47;windirstat.sourceforge.net&#47;">WinDirStat</a>.<&#47;li><br />
<&#47;ul><br />
<b>Tela de Cristal L&iacute;quido<&#47;b></p>
<ul>
<li>Descubra se existem pontos na tela com o <a href="http:&#47;&#47;www.softpedia.com&#47;get&#47;System&#47;Benchmarks&#47;Dead-Pixel-Tester.shtml">Dead Pixel Tester</a>.<&#47;li>
<li>Em certas ocasi&otilde;es &eacute; preciso deixar a resolu&ccedil;&atilde;o de tela, quantidade de cores ajustadas de forma espec&iacute;fica para dois ou mais programas. O <a href="http:&#47;&#47;www.entechtaiwan.com&#47;util&#47;ps.shtm">Powerstrip</a> permite criar um perfil para cada um deles, de modo que cercas caracter&iacute;sticas da placa de v&iacute;deo possam ser exigidas de acordo com a necessidade da aplica&ccedil;&atilde;o do usu&aacute;rio.<&#47;li><br />
<&#47;ul><br />
<b>Mem&oacute;ria<&#47;b></p>
<ul>
<li>Remova da mem&oacute;ria as informa&ccedil;&otilde;es que n&atilde;o est&atilde;o mais em uso.  <a href="http:&#47;&#47;www.amsn.ro&#47;">AMS Fast Defrag</a><&#47;li>
<li>A mem&oacute;ria &eacute; comumente o componente mais sens&iacute;vel de todo computador, podendo causar travamentos, instabilidade no sistema operacional. Fa&ccedil;a uma verifica&ccedil;&atilde;o completa com o <a href="http:&#47;&#47;www.memtest86.com&#47;">Memtest86</a>.<&#47;li><br />
<&#47;ul><br />
<b>Processador<&#47;b></p>
<ul>
<li>Desempenho: acompanhe com o <a href="http:&#47;&#47;www.panopsys.com&#47;Downloads.html">Throttlewatch</a> detalhadamente o que ocorre com seu processador.<&#47;li>
<li>Caracter&iacute;sticas: O <a href="http:&#47;&#47;www.cpuid.org&#47;cpuz.php">CPU-Z</a> fornece as especifica&ccedil;&otilde;es t&eacute;cnicas nos m&iacute;nimos detalhes.<&#47;li>
<li>Sobrecarga: tire o m&aacute;ximo do que ele &eacute; capaz com o <a href="http:&#47;&#47;cpu.rightmark.org&#47;download.shtml">RightMark CPU Clock Utility</a>.<&#47;li><br />
<&#47;ul><br />
Para finalizar, veja as <a href="http:&#47;&#47;www.sysinternals.com&#47;Utilities.html">ferramentas</a> que a Sysinternals disponibiliza para situa&ccedil;&otilde;es mais espec&iacute;ficas.</p>
