---
layout: post
status: publish
published: true
title: Sistema Operacional Online
date: '2006-03-13 23:00:57 -0300'
date_gmt: '2006-03-14 02:00:57 -0300'
categories:
- Geral
tags: []
comments:
- id: 19
  author: Paulo Gomes
  author_email: email@codeorama.com
  author_url: http://www.codeorama.com
  date: '2007-04-02 11:50:50 -0300'
  date_gmt: '2007-04-02 14:50:50 -0300'
  content: Webos s&atilde;o o futuro dos sistemas operacionais, onde o usu&aacute;rio
    poder&aacute; ter o mesmo `desktop`, acessar seus arquivos e programas em qualquer
    computador. Atualmente desenvolvo um sistema operacional 100% brasileiro.
---
<p>N&atilde;o h&aacute; mais sa&iacute;da. A plataforma Desktop se tornou Web, e n&atilde;o tem para ningu&eacute;m. Engana-se quem pensa que falo das tradicionais solu&ccedil;&otilde;es de <a href="http:&#47;&#47;gmail.google.com&#47;">e-mail</a>, <a href="http:&#47;&#47;wikipedia.org&#47;">enciclop&eacute;dia</a> ou <a href="http:&#47;&#47;flickr.com&#47;">&aacute;lbum</a> de fotos. Estou falando das ferramentas que utilizamos no dia-a-dia. Vejamos:</p>
<p><b>Editor de Imagens<&#47;b></p>
<p>O <a href="http:&#47;&#47;www.adobe.com&#47;products&#47;creativesuite&#47;main.html">Photoshop</a> &eacute; disparado a melhor solu&ccedil;&atilde;o para ambientes desktop. Mas quais s&atilde;o as principais tarefas realizadas por grande maioria dos usu&aacute;rios comuns? Vejamos: ampliar, reduzir, enquadrar, remover olhos vermelhos, tornar a foto mais clara, e porque n&atilde;o, aplicar um efeito s&eacute;pia? Ao final de tudo posso escolher entre salvar o meu trabalho, ou publicar diretamente para meu &aacute;lbum de fotos. Exemplos: <a href="http:&#47;&#47;pixoh.com&#47;">Pixoh</a>, <a href="http:&#47;&#47;pxn8.com&#47;">PXN8</a></p>
<p><b>Atlas Geogr&aacute;fico<&#47;b></p>
<p>Lembro bem do tempo de escola prim&aacute;ria, quando vendedores nos convenciam a comprar v&aacute;rios e v&aacute;rios mapas. Era tanta papelada que era preciso uma mesa para poder ver tudo, e mesmo assim sempre faltava algum detalhe, alguma informa&ccedil;&atilde;o. Hoje em dia podemos ir de Nova Iorque ao Rio de Janeiro em poucos segundos, com os detalhes dos pr&eacute;dios, das ruas e avenidas. Mas o <a href="http:&#47;&#47;www.google.com&#47;intl&#47;en&#47;options&#47;">servi&ccedil;o</a> que disponibiliza tudo isto n&atilde;o p&aacute;ra, pois resolveu nos mostrar a Lua, e at&eacute;, quem diria, <b>Marte<&#47;b>! Exemplos: Google <a href="http:&#47;&#47;maps.google.com&#47;maps?f=q&amp;hl=en&amp;q=Brazil&amp;ll=-12.168226,-51.152344&amp;spn=28.830665,55.546875">Maps</a>, <a href="http:&#47;&#47;earth.google.com&#47;">Earth</a>, <a href="http:&#47;&#47;moon.google.com&#47;">Moon</a> e <a href="http:&#47;&#47;www.google.com&#47;mars&#47;">Mars</a>.</p>
<p><b>Televis&atilde;o<&#47;b></p>
<p>Com uma placa de TV j&aacute; pude dispensar minha televis&atilde;o por algum tempo. Mas sempre que precisava assistir algum novo epis&oacute;dio de uma s&eacute;rie famosa, tinha que recorrer a servi&ccedil;os como o Kazzaa e Emule. Hoje as coisas est&atilde;o mudando, o conte&uacute;do vem at&eacute; voc&ecirc;, basta escolher o que deseja e aproveitar. Esta &eacute; a Web 2.0, onde a <a href="http:&#47;&#47;jnewland.com&#47;articles&#47;2006&#47;02&#47;22&#47;how-to-subscribe-to-tv-shows-using-the-democracy-player-bittorrent-rss">uni&atilde;o de algumas solu&ccedil;&otilde;es inteligentes</a>, nos permite ainda mais divers&atilde;o. Eis que surge a <b>WebTV<&#47;b>. Exemplo: <a href="http:&#47;&#47;www.getdemocracy.com&#47;">Democracy</a></p>
<p><b>Novas formas de pesquisa<&#47;b></p>
<p>O conte&uacute;do na internet est&aacute; cada vez mais acess&iacute;vel, mas continua muito longe do ideal, per&iacute;odo em que os <a href="http:&#47;&#47;www.revolucao.etc.br&#47;archives&#47;microformats&#47;">Micro Formatos</a> v&atilde;o estar mais presentes nas entre-linhas de cada conte&uacute;do dispon&iacute;vel na rede. Exemplos: <a href="http:&#47;&#47;scribbling.net&#47;projects&#47;wikipedizetext&#47;">Wikipedize any text</a>, <a href="http:&#47;&#47;www.scuttle.org&#47;">Scuttle</a>, <a href="http:&#47;&#47;similicio.us&#47;">Similicio.us</a> e <a href="http:&#47;&#47;www.43things.com&#47;">43Things</a>.</p>
<p><b>Enfim, o Desktop Online<&#47;b></p>
<p>Agora seja sincero comigo. A integra&ccedil;&atilde;o de todas estas ferramentas em uma s&oacute; solu&ccedil;&atilde;o parece distante? N&atilde;o precisa imaginar, veja <a href="http:&#47;&#47;www.eyeos.org&#47;">por si mesmo</a>. Melhor, n&atilde;o basta olhar, experimente a <a href="http:&#47;&#47;www.eyeos.net&#47;eyeOS&#47;">vers&atilde;o de demonstra&ccedil;&atilde;o</a>. Muito mais ainda est&aacute; por vir... O Google, que j&aacute; lan&ccedil;ou um servi&ccedil;o de constru&ccedil;&atilde;o de sites pessoais, divulgou em <a href="http:&#47;&#47;googleblog.blogspot.com&#47;2006&#47;03&#47;writely-so.html">seu blog</a> a compra da <a href="http:&#47;&#47;www.writely.com&#47;">Writely</a>, inclusive j&aacute; comentei <a href="http:&#47;&#47;heliocorreia.wordpress.com&#47;2005&#47;12&#47;22&#47;ferramentas-para-um-mundo-interoperavel&#47;">sobre ela</a>.</p>
<p>Eu quero &eacute; saber se v&atilde;o aumentar de 24 para 30 horas por dia, porqu&ecirc; &eacute; imposs&iacute;vel acompanhar tudo isto.</p>
